print()
print('= = = = = = = = = = = = = = = = = = ')
print()
print('--- Оператор присваивания. ---')
print()
# |--- -----------------------------------------------------
print('- - - Инициализация переменных. - - -')
a = 5
b = 3 + 5
print(a, b)
print('- - - - - - - - - - - - - - - - - - ')
print()
# |--- -----------------------------------------------------
print('- - - Каскадное присваивание. - - -')
a = b = c = 5
print(a, b, c)
print('- - - - - - - - - - - - - - - - - - ')
print()
# |--- -----------------------------------------------------
print('- - - Составное присваивание. - - -')
a = 2
a += 5
print(a)
print('- - - - - - - - - - - - - - - - - - ')
print()
# |--- -----------------------------------------------------
print('- - - Множественное присваивание. - - -')
a, b, c = 5, 3, 1
print(a, b, c)
a, b = 5, 3
print(a, b)
a, b = b, a
print(a, b)
print('- - - - - - - - - - - - - - - - - - ')
print()
# |--- -----------------------------------------------------
print('- - - Множественное присваивание со списками. - - -')
list1 = [5, 3, 1]
print(list1)
a, b, c = list1
print(a, b, c)
print('- - - - - - - - - - - - - - - - - - ')
print()
# |--- -----------------------------------------------------
print('- - - Множественное присваивание со строками. - - -')
str1 = "Привет."
print(str1)
a, b, c, d, e, f, g = str1
print(a, b, c, d, e, f, g)
print('- - - - - - - - - - - - - - - - - - ')
# |--- -----------------------------------------------------
print()
print('= = = = = = = = = = = = = = = = = = ')
print()
print('--- Работа с типами данных ---')
# |--- -----------------------------------------------------
print()
print('1. ->->-> Ввод строк: ->->-> 1.')
print()
print('Введите первую строку:')           # вводится строка
a = input()
b = input('Введите вторую строку: ')      # вводится строка
print(a,'+', b, '=', a + b)               # конкатенация
print()
print('1. <-<-<- Ввод строк: <-<-<- 1.')
# -------------------------------------------------------
print()
print('2. ->->-> Типы данных и их конвертация: ->->-> 2.')
print()
c = 5.67
print(c + 3.67)
print(type(c))

d = str(c)
print(d + '76')                           # конкатенация
print(type(d))

c = int(c)
print(c)
print(type(c))

e = 1
e = bool(e)
print(e)
print(type(e))
print()
print('2. <-<-<- Типы данных и их конвертация: <-<-<- 2.')
# -------------------------------------------------------
print()
print('3. ->->-> Ввод чисел: ->->-> 3.')
print()
f = int(input('Введите 1–e число: '))     # вводится число
g = int(input('Введите 2–e число: '))     # вводится число
print(f, '+', g, '=', f + g)  # математическое действие
print()
print('3. <-<-<- Ввод чисел: <-<-<- 3.')
# -------------------------------------------------------
print()
print('4. ->->-> Арифметические операции: ->->-> 4.')
print()
ff = 5
gg = 2
print(ff, '+', gg, '=', ff + gg, '  <- Сложение.')
print(ff, '-', gg, '=', ff - gg, '  <- Вычитание.')
print(ff, '*', gg, '=', ff * gg, '  <- Умножение.')
print(ff, '/', gg, '=', ff / gg, '  <- Деление (вещественных числах).')
print(ff, '//', gg, '=', ff // gg, '  <- Целочисленное деление.')
print(ff, '%', gg, '=', ff % gg, '  <- Остаток от деления.')
print(ff, '**', gg, '=', ff ** gg, '  <- Возведение в степень.')
print()
print('4. <-<-<- Арифметические операции: <-<-<- 4.')
# -------------------------------------------------------
print()
print('5. ->->-> Округление: ->->-> 5.')
print()
h = 4.584738754
m = 8.37276
print(h * m)
print(round(h * m, 7))
print(round(h * m, 3))
print()
print('5. <-<-<- Округление: <-<-<- 5.')
# -------------------------------------------------------
print()
print('--- Работа с типами данных ---')
print()
