print()
print('--- Работа с типами данных ---')
# -------------------------------------------------------
print()
print('->->-> Ввод строк: ->->->')
print('Введите первую строку:')        # вводится строка
a = input()
b = input('Введите вторую строку: ')     # вводится строка
print(a,'+', b, '=', a + b)     # конкатенация
print('<-<-<- Ввод строк: <-<-<-')
# -------------------------------------------------------
print()
print('->->-> Типы данных и их конвертация: ->->->')
c = 5.67
print(c)
print(type(c))

d = str(c)
print(d + '76')     # конкатенация
print(type(d))

c = int(c)
print(c)
print(type(c))

e = 1
e = bool(e)
print(e)
print(type(e))
print('<-<-<- Типы данных и их конвертация: <-<-<-')
# -------------------------------------------------------
print()
print('->->-> Ввод чисел: ->->->')
f = int(input('Введите 1–e число: '))  # вводится число
g = int(input('Введите 2–e число: '))  # вводится число
print(f, '+', g, '=', f + g)  # математическое действие
print('<-<-<- Ввод чисел: <-<-<-')
# -------------------------------------------------------
print()
print('->->-> Арифметические операции: ->->->')
ff = 5
gg = 2
print(ff, '+', gg, '=', ff + gg, '  <- Сложение.')
print(ff, '-', gg, '=', ff - gg, '  <- Вычитание.')
print(ff, '*', gg, '=', ff * gg, '  <- Умножение.')
print(ff, '/', gg, '=', ff / gg, '  <- Деление (вещественных числах).')
print(ff, '//', gg, '=', ff // gg, '  <- Целочисленное деление.')
print(ff, '%', gg, '=', ff % gg, '  <- Остаток от деления.')
print(ff, '**', gg, '=', ff ** gg, '  <- Возведение в степень.')
print('<-<-<- Арифметические операции: <-<-<-')
# -------------------------------------------------------
print()
print('->->-> Округление: ->->->')
h = 4.584738754
m = 8.37276
print(h * m)
print(round(h * m, 7))
print(round(h * m, 3))
print('<-<-<- Округление: <-<-<-')
# -------------------------------------------------------
print()
print('--- Работа с типами данных ---')
print()
