print()
print('--- Циклы ---')
# -------------------------------------------------------
print()
print('->->-> while ->->->')
print('- - - - - - - - - - - - - - - - - - ')
print('- Найти сумму цифр введённого числа \'N\' - ')
n = 423
summa = 0
while n > 0:
    x = n % 10
    summa += x
    n //= 10
print('Сумма чисел = ', summa)  # 9
print('- - - - - - - - - - - - - - - - - - ')
# -------------------------------------------------------
""" print()
print('- - - - - - - - - - - - - - - - - - ')
i=0
while i < 5:
    # if i == 3:
    #     break
    i=i+1
else:
    print('Пожалуй')
    print('Фатит :)')
print(i)
print('- - - - - - - - - - - - - - - - - - ') """
# -------------------------------------------------------
print()
print('- - - - - - - - - - - - - - - - - - ')
print('- Поиск минимального делителя. -')
print()
n = int(input('Введите число: '))
flag = True
i=2
while flag:
    if n % i == 0:      # если остаток при делении числа n на i равен 0 flag = False
        print(f'Минимальный делитель числа {n} = {i}')
        flag = False
    elif i > n // 2:    # делитель числа не может превышать введенное число, деленное на 2
        print(n)
        flag = False
    i += 1
print('- - - - - - - - - - - - - - - - - - ')
print('<-<-<- while <-<-<-')
# -------------------------------------------------------
print()
print('->->-> for ->->->')
print('- - - - - - - - - - - - - - - - - - ')
for i in 1, -2, 3, 14, 5:
    print(i)        # 1 -2 3 15 5 - вывод в столбик.
print('- - - - - - - - - - - - - - - - - - ')
for i in 1, -2, 3, 14, 5:       # вывод в строку.
    print(i, end = ' ')         # end = ' ' - разделитель.
print()
print('- - - - - - - - - - - - - - - - - - ')
print('- Создание матрицы. -')
print()
line = ""
for i in range(5):
    line = ""
    for j in range(5):
        line += " * "
    print(line)
print('- - - - - - - - - - - - - - - - - - ')
print('<-<-<- for <-<-<-')
print()
print('--- Циклы ---')
print()
