#   todo-tree.highlights.customHighlight
        # BUG ---------------
        # HACK ---------------
        # FIXME ---------------
        # TODO ---------------
        # XXX ---------------
        # -T- ---------------
        # -I- ---------------
        # -C- ---------------
        # -F- ---------------
        # [ ] ---------------
        # [x] ---------------
        # [--] ---------------
        # [-] ---------------
#   better-comments.tags
        # ! ---------------
        # ? ---------------
        # // ---------------
        # todo ---------------
        # * ---------------

print()
print('= = = = = = = = = = = = = = = = = = ')
print()
print('---  Коллекции данных. ---')
print()
print('- - - Объявление и вывод. - - - ')
print('- - - - - - - - - - - - - - - - - - ')
list_1 = []
print(f'\'list_1 = []\'  ->  {list_1}  ->  {type(list_1)}   -  Список.')
print('- - - - - - - - - - - - - - - - - - ')
list_1 = ()
print(f'\'list_1 = ()\'  ->  {list_1}  ->  {type(list_1)}  -  Кортеж.')
print('- - - - - - - - - - - - - - - - - - ')
# print()
print('= = = = = = = = = = = = = = = = = = ')
print()
# [ ] -----------------------------------------------------
print('->->-> Списки ->->->')
# [ ] -----------------------------------------------------
print()
print('--- Список - упорядоченный конечный набор элементов. ---')
print('--- Список <-> Массив. ---')
print()
# -C- -----------------------------------------------------
print('- - - Объявление и вывод Списка. - - - ')
# |--- -----------------------------------------------------
print()
list_1 = []
print(f'\'list_1 = []\'  ->  {list_1}  ->  {type(list_1)}  -  Список.')
print()
print('- - - - - - - - - - - - - - - - - - ')
list_1 = list()
print(list_1)
print('- - - - - - - - - - - - - - - - - - ')
list_1 = [5, 3, 6, 1, 2, 9]
print(list_1)
print('- - - - - - - - - - - - - - - - - - ')
list_1 = [5, 3, 6, 1, 2, 9]
print(*list_1)
print('- - - - - - - - - - - - - - - - - - ')
# -f- -------------------------------------------------------
print('- - - \'print(..., end = " ")\' - в строку.    Вывод через \'For\'  -   - - - ')
# |--- -----------------------------------------------------
list_1 = [3, 6, 1, 2]
for i in list_1:
  print(i, end = " ")
print()
print('- - - - - - - - - - - - - - - - - - ')
# -f- ------------------------------------------------------
print('- - - \'len(name)\'  -  Длина списка - - - ')
# |--- -----------------------------------------------------
print(len(list_1))
print('- - - - - - - - - - - - - - - - - - ')
# -f- ------------------------------------------------------
print('- - - \'list_1[0]\'  -  Обращение к элементу - - - ')
# |--- -----------------------------------------------------
list_1 = [3, 6, 1, 8]
print(f'{list_1} - исходный список')
print(list_1[0])          # 1-й элемент с начала
print(list_1[-4])         # 4-й элемент с конца
print(list_1[3])          # 4-й элемент с начала
print(list_1[-1])         # 1-й элемент с конца
print('- - - - - - - - - - - - - - - - - - ')
# -f- ------------------------------------------------------
print('- - - \'.append(8)\'  -  Добавление элемента в конец списка - - - ')
# |--- -----------------------------------------------------
list_1 = [1, 2]           # создание списка
print(f'{list_1} - исходный список')
list_1.append(8)          # добавление элемента в конец списка
print(list_1)
list_1.append(85)         # добавление элемента в конец списка
print(list_1)
print('- - - - - - - - - - - - - - - - - - ')
print('- - - Заполнение списка через \'For\' - - - ')
print('- - - 1. Авто заполнение. - - - ')
# |--- -----------------------------------------------------
list_1 = []
print(list_1)
for i in range(5):
  list_1.append(i)
  print(list_1)
print('- - - 2. Заполнение через консоль. - - - ')
# |--- -----------------------------------------------------
print('...')
""" list_1 = list()           # создание пустого списка
for i in range(5):        # цикл выполнится 5 раз
  n = int(input(f'Введите {i+1}-е число: ')) # пользователь вводит целое число
  list_1.append(n)        # сохранение элемента в конец списка
# 1-я итрция: n = 12, list_1 = [12]
# 2-я итрция: n = 7,  list_1 = [12, 7]
# 3-я итрция: n = -1, list_1 = [12, 7, -1]
# 4-я итрция: n = 21, list_1 = [12, 7, -1, 21]
# 5-я итрция: n = 0,  list_1 = [12, 7, -1, 21, 0] 
  print(list_1) """
print('- - - - - - - - - - - - - - - - - - ')
print()
print('- - Основные действия со списками: - - ')
print('- - - - - - - - - - - - - - - - - - ')
# -f- ------------------------------------------------------
print('- - - \'.pop()\'  -  Удаление последнего элемента списка. - - - ')
# |--- -----------------------------------------------------
list_1 = [12, 7, -1, 21, 0]
print(f'{list_1} - исходный список')
print(f'удалит: {list_1.pop()}')    # удаляет 0
print(list_1)                       # [12, 7, -1, 21]
print(f'удалит: {list_1.pop()}')    # удаляет 21
print(list_1)                       # [12, 7, -1]
print('- - - - - - - - - - - - - - - - - - ')
# -f- ------------------------------------------------------
print('- - - \'.pop(0)\'  -  Удаление конкретного элемента, по индексу, из списка. - - - ')
# |--- -----------------------------------------------------
list_1 = [12, 7, -1, 21, 0]
print(f'{list_1} - исходный список')
print(list_1.pop(0))                # 12
print(list_1)                       # [7, -1, 21, 0]
print('- - - - - - - - - - - - - - - - - - ')
# -f- ------------------------------------------------------
print('- - - \'.insert(2, 11)\'  -  Добавление элемента на нужную позицию. - - - ')
# |--- -----------------------------------------------------
list_1 = [12, 7, -1, 21, 0]
print(f'{list_1} - исходный список')
list_1.insert(2, 11)
print(list_1)                        # [12, 7, 11, -1, 21, 0]
print()
print('<-<-<- Списки <-<-<-')
print()
# print('- - - - - - - - - - - - - - - - - - ')
print('= = = = = = = = = = = = = = = = = = ')
# print('- - - - - - - - - - - - - - - - - - ')
print()
# [ ] -----------------------------------------------------
print('->->-> Срез списка (по индексу). ->->-> ')
# [ ] -----------------------------------------------------
print()
print('- - - - - - - - - - - - - - - - - - ')
list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(f'{list_1} - исходный список')
# |--- -----------------------------------------------------
print('- - - - - - - - - - - - - - - - - - ')
print(list_1[0])                # 1
print(list_1[1])                # 2
print(list_1[len(list_1)-1])    # 10
print(list_1[-1])               # 10
print(list_1[-5])               # 6
print(list_1[:])                # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(list_1[:2])               # [1, 2]
print(list_1[len(list_1)-2:])   # [9, 10]
print(list_1[2:9])              # [3, 4, 5, 6, 7, 8, 9]
print(list_1[6:-18])            # []
print(list_1[0:len(list_1):6])  # [1, 7]
print(list_1[::6])              # [1, 7]
print('- - - - - - - - - - - - - - - - - - ')
print('print ( list_1 [ начало : конец : шаг ] )')
# |--- -----------------------------------------------------
print('- - - - - - - - - - - - - - - - - - ')
print()
print('<-<-<- Срез списка (по индексу). <-<-<- ')
print()
print('= = = = = = = = = = = = = = = = = = ')
print()
# [ ] -----------------------------------------------------
print('->->-> Кортеж. ->->-> ')
# [ ] -----------------------------------------------------
print()
print('- - - Кортеж — это неизменяемый список, занимает меньше места в памяти и работают быстрее. - - - ')
# |--- -----------------------------------------------------
print()
print('- - - - - - - - - - - - - - - - - - ')
print('- - - Объявление и вывод Кортежа. - - - ')
# |--- -----------------------------------------------------
print('- - - - - - - - - - - - - - - - - - ')
print()
t = ()
print(f'\'t = ()\'             -> {type(t)}  <-    Кортеж.')
print('\'print(t)\'  - ',t)                     # ()
print('\'print(*t)\' - ', *t)                   # ничего не видно

print('- - - - - - - - - - - - - - - - - - ')
print()
t = ('Hi')
print(f'\'t = (\'Hi\')\'         -> {type(t)}    <-    Строка.')
print('\'print(t)\'  - ',t)                     # Hi
print('\'print(*t)\' - ', *t)                   # H i

print('- - - - - - - - - - - - - - - - - - ')
print()
t = ('Hi',)
print(f'\'t = (\'Hi\',)\'        -> {type(t)}  <-    Кортеж.')
print('\'print(t)\'  - ',t)                     # ('Hi',)
print('\'print(*t)\' - ', *t)                   # Hi

print('- - - - - - - - - - - - - - - - - - ')
print()
t = ('Hi', 'Я')
print(f'\'t = (\'Hi\', \'Я\')\'    -> {type(t)}  <-    Кортеж.')
print('\'print(t)\'  - ',t)                     # ('Hi', 'Я')
print('\'print(*t)\' - ', *t)                   # Hi Я

print('- - - - - - - - - - - - - - - - - - ')
print()
t = (1)
print(f'\'t = (1)\'            -> {type(t)}    <-    Число.')
print('\'print(t)\'  - ',t)                     # 1
print('\'print(*t)\' - ', 'TypeError: ...')     # TypeError: print() argument after * must be an iterable, not int

print('- - - - - - - - - - - - - - - - - - ')
print()
t = (1,)
print(f'\'t = (1,)\'           -> {type(t)}  <-    Кортеж.')
print('\'print(t)\'  - ', t)                    # (1,)
print('\'print(*t)\' - ', *t)                   # 1

print('- - - - - - - - - - - - - - - - - - ')
print()
t = (1, 3, 5)
print(f'\'t = (1, 3, 5)\'      -> {type(t)}  <-    Кортеж.')
print('\'print(t)\'  - ', t)                    # (1, 3, 5)
print('\'print(*t)\' - ', *t)                   # 1 3 5
# print('\'print(t)\' -> ', t, '; \'print(*t)\' -> ', *t)                   # 1 3 5
# print('\'print(*t)\' - ', *t, '; \'print(t)\' - ', t)                   # 1 3 5

print('- - - - - - - - - - - - - - - - - - ')
print()
print('- - - Типы данных и их конвертация. - - - ')
# |--- -----------------------------------------------------

print('- - - - - - - - - - - - - - - - - - ')
Lst = ['red', 'green', 'blue']  # ['red', 'green', 'blue']
print('           - Из Списка: -')
print(f'\'Lst = [\'red\', \'green\', \'blue\']\'        ->  {Lst}  ->  {type(Lst)}   -  Список.')
print()
Tpl = tuple(Lst)                  # ('red', 'green', 'blue')
print('           - Конвертируем в Кортеж: -')
print(f'\'Tpl = tuple(Lst)\'                      ->  {Tpl}  ->  {type(Tpl)}  -  Кортеж.')
print()
Tpl = tuple(['red', 'green', 'blue'])
print('           - Или так: -')
print(f'\'Tpl = tuple([\'red\', \'green\', \'blue\'])\' ->  {Tpl}  ->  {type(Tpl)}  -  Кортеж.')
print('- - - - - - - - - - - - - - - - - - ')

print('- - - - - - - - - - - - - - - - - - ')
print(f'{Tpl[0]}       # \'Tpl[0]\'')                    # red
print(f'{Tpl[2]}      # \'Tpl[2]\'')                     # blue
print('- - - Заполнение кортежа через \'For\' - - - ')
for e in Tpl:
  print(e, end =' | ')          # red | green | blue
print()
print('- - - - - - - - - - - - - - - - - - ')
print()
t = ['red', 'green', 'blue']
t[0] = 'black'
print(t)
print(t[0])
t = ('red', 'green', 'blue')
# t[0] = 'black'                  # TypeError: 'tuple' object does not support(нельзя изменять кортеж)
print(t)
print(t[0])
print('- - - - - - - - - - - - - - - - - - ')
print()
t = tuple(['red', 'green', 'blue'])
t = ('red', 'green', 'blue')
print(t)
r, g, b = t
print(r, g, b)
red, green, blue = t
print('r:{} g:{} b:{}'.format(red, green, blue))    # r:red g:green b:blue


print()
# print('<-<-<- Кортеж. <-<-<- ')
# print()
# print('- - - - - - - - - - - - - - - - - - ')
# |--- -----------------------------------------------------
print('- - - - - - - - - - - - - - - - - - ')
print()
# print()
