print()
print('= = = = = = = = = = = = = = = = = = ')
print()
print('          ---  Р Е К У Р С И Я . ---')
print('--- Максимальная глубина рекурсии ~ 1000. ---')
print()
print('   - - -  ВАЖНЫЕ СОСТАВЛЯЮЩИЕ РЕКУРСИИ:  - - -')
print('! ! !  1. Условие выход из рекурсии !!!  ! ! !')
print('- - -  2. Рекурентная функция (повторяющийся фрагмент кода)  - - -')
print('- - - - - - - - - - - - - - - - - - ')
# [ ] -----------------------------------------------------
print()
# print('->->-> Пример_01: ->->-> ')
# https://www.youtube.com/watch?v=jvFULnNpNLg&list=PLQAt0m1f9OHvv2wxPGSCWjgy1qER_FvB6&index=44
# 00.50
print('Пример_01:   Как работает рекурсия ?')
# -F- -----------------------------------------------------
def rec(x):
    if x < 5:               # Условие выход из рекурсии.
        print(x, end='  ')
        rec(x + 1)          # Рекурентная функция.
        print(x, end='  ')
# -F- -----------------------------------------------------
#  *  -----------------------------------------------------
rec(1)
print()
#  *  -----------------------------------------------------
# print('<-<-<- Пример_01: <-<-<- ')
print()
print('- - - - - - - - - - - - - - - - - - ')
# [ ] -----------------------------------------------------
print()
# print('->->-> Пример_02: ->->-> ')
# https://www.youtube.com/watch?v=jvFULnNpNLg&list=PLQAt0m1f9OHvv2wxPGSCWjgy1qER_FvB6&index=44
# 05.05
print('Пример_:   Факториал.')
# -F- -----------------------------------------------------
def fact(x):
    if x == 1:                     # Условие выход из рекурсии.
        return 1
    return fact(x - 1) * x          # Рекурентная функция.
# -F- -----------------------------------------------------
#  *  -----------------------------------------------------
print(f'3  ->    {fact(3)}')
print(f'4  ->   {fact(4)}')
print(f'5  ->  {fact(5)}')
#  *  -----------------------------------------------------
# print('<-<-<- Пример_02: <-<-<- ')
print()
print('- - - - - - - - - - - - - - - - - - ')
# [ ] -----------------------------------------------------
print()
# print('->->-> Пример_04: ->->-> ')
# https://www.youtube.com/watch?v=jvFULnNpNLg&list=PLQAt0m1f9OHvv2wxPGSCWjgy1qER_FvB6&index=44
# 07.55 (10.30 - как это работает.)
print('Пример_:   Фибоначчи(медленно) - Лучше использовать \'For\'.')
# -F- -----------------------------------------------------
def fib(x):
    if x == 1:                     # Условие выход из рекурсии.
        return 0
    if x == 2:                     # Условие выход из рекурсии.
        return 1
    return fib(x - 1) + fib(x - 2)          # Рекурентная функция.
# -F- -----------------------------------------------------
#  *  -----------------------------------------------------
print(f'10  ->   {fib(10)}')
print(f'11  ->   {fib(11)}')
print(f'12  ->   {fib(12)}')
# print(f'35  ->   {fib(35)}')        # Очень долго(чем выше значение).
#  *  -----------------------------------------------------
# print('<-<-<- Пример_04: <-<-<- ')
print()
print('- - - - - - - - - - - - - - - - - - ')
# [ ] -----------------------------------------------------
print()
# print('->->-> Пример_05: ->->-> ')
# https://www.youtube.com/watch?v=jvFULnNpNLg&list=PLQAt0m1f9OHvv2wxPGSCWjgy1qER_FvB6&index=44
# 12.50
print('Пример_:   Палиндром(строки).')
# -F- -----------------------------------------------------
def palindrom(s):
    if len(s) <= 1:                     # Если длина < или = 1 символу.
        # return True                               # РАБОТАЕТ !!!
        # return 'Строка является палиндромом.'     # РАБОТАЕТ !!!
        string = 'Строка является палиндромом !!!'
        return string
        # print('Строка является палиндромом')      # НЕ РАБОТАЕТ !!!
    if s[0] != s[-1]:                   # Условие выход из рекурсии.
        print(s)
        # return False                              # РАБОТАЕТ !!!
        return 'НЕ Палиндром.'                      # РАБОТАЕТ !!!
    print(s)
    return palindrom(s[1:- 1])          # Рекурентная функция.
# -F- -----------------------------------------------------
#  *  -----------------------------------------------------
print(palindrom('saippuakivikauppias'))
print(palindrom('шалаш'))
print(palindrom('1234321'))
print(palindrom('фут как туф'))
#  *  -----------------------------------------------------
# print('<-<-<- Пример_05: <-<-<- ')
print()
print('- - - - - - - - - - - - - - - - - - ')
# [ ] -----------------------------------------------------

# print('- - - - - - - - - - - - - - - - - - ')
# print()
print('= = = = = = = = = = = = = = = = = = ')
# print()
# [ ] -----------------------------------------------------
# print('->->-> Списки ->->->')
# [ ] -----------------------------------------------------
# print()
# print('--- Список <-> Массив. ---')
# print()
# -C- -----------------------------------------------------
# print('- - - Объявление и вывод Списка. - - - ')
# |--- -----------------------------------------------------
# print()
# -f- -------------------------------------------------------
# |--- -----------------------------------------------------
# print()

# ? -----------------------------------------------------
# ! -----------------------------------------------------

# print('<-<-<- Словари. <-<-<- ')
# print()
print('= = = = = = = = = = = = = = = = = = ')
# print()
# print('- - - - - - - - - - - - - - - - - - ')
print()
# print()
